announcements/outline-and-repeat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-26 Tue 08:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Together: The Old And New Are  Much Better!</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Together: The Old And New Are  Much Better!</h1>
<div id="outline-container-org589c8be" class="outline-2">
<h2 id="org589c8be"><span class="section-number-2">1.</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs has had long-standing features like <code>outline-mode</code> and
<code>outline-minor-mode</code> that often get forgotten in the face of newer
affordances like <code>org-mode</code>. At the same time, Emacs continues to
acquire new features &#x2014; in this article, I am specifically alluding
to <code>repeat-mode</code>. The combinatorial explosion that is the result of
the various ways of bringing these together is mind-boggling &#x2014; and
often the result is that one fails to take advantage of what has
become possible. The result is that one ends up sticking to one's
long-established habits at the risk of failing to significan\'tly
enhance one's productivity.
</p>
</div>
</div>

<div id="outline-container-orgaac66c5" class="outline-2">
<h2 id="orgaac66c5"><span class="section-number-2">2.</span> Background</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Structured navigation is a significan\'t productivity enhancer &#x2014;
especially in my case since I rely exclusively on an auditory interface.</li>
<li>The above applies to both textual documents and programming source.</li>
<li>Starting all the way back in 1991, I started using <code>folding-mode</code>
to organize code into hierarchical containers that could be
expanded and collapsed; and this is what makes Emacs' eco-system
amazing; <code>folding-mode</code> still works and is available on melpa in 2023.</li>
<li>About a year ago one of the Emacs maintainers (Stefan Mounier)
helped me update portions of Emacspeak, and in the process pointed
out that I could just use <code>outline-minor-mode</code> to expand and
collapse sections of  code in <code>.el</code> files.</li>
<li>At the time I filed this away for <i>later use</i> &#x2014; I was still
reluctant to  abandon the 30+ year investment in <code>folding-mode</code>.</li>
<li>About a year ago, I discovered <code>repeat-mode</code> in Emacs and started
leveraging it for everything &#x2014; including <code>outline-mode</code> and
<code>org-mode</code> amongst others.</li>
<li>Despite the years of investment in <code>folding-mode</code>, it had one
drawback; keeping the <i>fold-marks</i> (special comments) in sync was
always a bit of a hastle.

<ul class="org-ul">
<li><p>
Bringing The Old And New Together
</p>

<p>
This week I brought all of the above context together to:
</p></li>
</ul></li>

<li>Cut over the Emacspeak codebase to stop using <code>folding-mode</code>.</li>

<li>Turning the <span class="underline">fold-marks</span> to comments that <code>outline-minor-mode</code>
understood  was a trivial application of my <a href="https://github.com/tvraman/emacspeak/blob/master/etc/typo.pl#L1">typo.pl</a>Perl script.</li>

<li>I had already set up Emacspeak to use <code>repeat-mode</code> for the
various outline modes.</li>

<li>Another annoyance with <code>outline</code> that I had fixed over 20+ years
ago was to pick an easier to press prefix-key for <code>outline</code>; I use
<span class="underline">C-o</span>.</li>
</ul>
</div>
</div>

<div id="outline-container-org925e227" class="outline-2">
<h2 id="org925e227"><span class="section-number-2">3.</span> The Resulting Experience</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>I can now skim the Emacspeak sources (as well as the Emacs
sources of course) with very few keystrokes.</li>
<li>Example: Pressing <span class="underline">C-o C-n</span> navigates by section headings; when
skimming, I only need to press <span class="underline">C-o</span> the first time thanks to
<code>repeat-mode</code>.</li>
<li>I also bound <span class="underline">j</span> and <span class="underline">k</span> in  the outline-mode keymaps to avoid
having to chord when skimming &#x2014; <span class="underline">j</span> is easier to press than <span class="underline">C-n</span>.</li>
</ul>
</div>
</div>

<div id="outline-container-org44a3e17" class="outline-2">
<h2 id="org44a3e17"><span class="section-number-2">4.</span> For The Future</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Would be nice to enhance <code>outline-minor-mode</code> to understand
sectioning comments in other programming languages.
<ul class="org-ul">
<li>The annoyance with the default (and unusable) prefix key for the
outline modes needs to fix in Emacs core.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-09-26 Tue 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2023-09-26 Tue 08:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>